<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f650d4216f7be1edf57339e4f49a59b626cb509dab3191fdf2e5999a70d24bb1","plan_job_ref":"Job Terraform plan #27 at https://github.com/mkuthan/stream-processing/actions/runs/7235203125","plan_hash":"47b7ac77d7a6cf111ac59f0bd8174d7f68557d19e9aece20f532380c6094cfe5","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-entry"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-exit"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
  + resource "google_pubsub_subscription" "vehicle-registration-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "vehicle-registration"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #27](https://github.com/mkuthan/stream-processing/actions/runs/7235203125)